---
kind: method
id: M:Autodesk.Revit.DB.IDataConversionMonitor.GetVerbosity
source: html/06a621c3-f8df-5d38-b164-2b15428ce566.htm
---
# Autodesk.Revit.DB.IDataConversionMonitor.GetVerbosity Method

Reports requested verbosity level

## Syntax (C#)
```csharp
DataExchangeMessageVerbosity GetVerbosity()
```